package com.safasoftco.amanalrasool;

import com.safasoftco.amanalrasool.R.id;

import android.support.v7.app.ActionBarActivity;
import android.app.Activity;
import android.content.pm.ActivityInfo;
import android.graphics.Color;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.view.Window;
import android.view.WindowManager;
import android.widget.TextView;

public class TafsirActivity extends Activity {

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setRequestedOrientation(ActivityInfo.SCREEN_ORIENTATION_LANDSCAPE);
		requestWindowFeature(Window.FEATURE_NO_TITLE);
        getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN,
            WindowManager.LayoutParams.FLAG_FULLSCREEN);
		setContentView(R.layout.activity_tafsir);
		
		String ta= "تعریف"  + "\n"
				 + "\n" + "آیه آمن الرّسول به دلیل این که با عبارت: «ءَامنَ الرَّسول» آغاز مى‌شود، به این نام شهرت یافته است. منشأ این شهرت، روایات فراوانى است که از پیامبر صلی الله علیه و آله و امامان معصوم علیهم السلام در فضیلت و قرائت آن‌ نقل شده. مجموع این روایات، از عظمت این دو آیه خبر مى‌دهد. از پیامبر درباره فضیلت آن نقل شده که دو آیه آخر بقره، از گنجى در زیر عرش الهی به وى بخشیده شده است."
				 + "\n" + "نقل شده که هرگاه پیامبر این دو آیه و آیة‌ الکرسی را قرائت می‌کرد، تبسّم نموده، مى‌فرمود: آن دو، از گنج الهىِ زیر عرش است."
				 + "\n" + "در روایت دیگرى که قتاده به طور مرسل از پیامبر نقل کرده، آمده است که خداوند، دو هزار سال پیش از آفرینش آسمان‌ها و زمین، کتابى داشته و دو آیه آخر بقره را از آن فرود آورده است؛ پس اگر آن دو، سه شب در خانه‌اى خوانده شود، شیطان به‌آن نزدیک نمى‌شود." 
				 + "\n" + "هم چنین درباره نزول این دو آیه، دو روایت به ظاهر متضاد دیده مى‌شود. در روایتى از ابن‌عبّاس آمده است که رسول خدا در حالى که جبرئیل در حضورش بود، صدایى را از بالاى سر خود شنید. جبرئیل با نگاه به آسمان گفت: هم اکنون درى از آسمان باز شد که تاکنون گشوده نشده بود؛ سپس فرشته‌اى فرود آمد و پیامبر صلى الله علیه و آله را به دو نور، یکى فاتحة الکتاب و دیگرى آیات پایانى سوره بقره بشارت داد که به هیچ پیامبر دیگرى داده نشده بود."
				 + "\n" + "در روایت دیگرى از امام صادق علیه السلام آمده که این دو آیه، در معراج به پیامبر اعطا شد؛ امّا گویا هیچ یک از این دو روایت، به زمان نزول آیه اشاره‌ اى ندارند و فقط در مقام تکریم و تعظیم این دو آیه هستند."
				 + "\n" + "\n" + "روایات در باب فضیلت قرائت آنها" 
				 + "\n" + "در زمینه آثار و فضیلت قرائت آن، از پیامبر صلى الله علیه و آله نقل شده که هر کس دو آیه آخر بقره را در شب بخواند، او را کفایت می‌کند."
				 + "\n" + "از امام علی علیه السلام نقل شده که هر کس اسلام را دریافته باشد، پیش از قرائت آمن‌الرسول و آیةالکرسی نمى‌خوابد."
				 + "\n" + "این دو آیه، چکیده سوره بقره را در بر دارد و موضوع کلّى و غرض نهایى این سوره در همین دو آیه گنجانده شده است؛ زیرا در این سوره که بزرگ ‌ترین سوره قرآن است، مسلمانان دعوت شده‌اند تا به اصول اعتقادى اسلام چون اللّه، معاد، فرشتگان، پیامبران و کتاب‌هاى آسمانى ایمان بیاورند. بسیارى از تکالیف الهى درباره شؤون گوناگون امّت اسلامى نیز در همین سوره بیان شده و سرپیچى یهود از فرامین خداوند، ایمان نیاوردن به برخى پیامبران، تشریع تکالیف مشقّت بار و دشمنى با برخى فرشتگان در آن ذکر شده است."
				 + "\n" + "در جهت مضامین این دو آیه و سفارش به فراگیرى و قرائت آن، از پیامبر صلى الله علیه و آله نقل شده که این دو آیه را فراگیرید و به دختران و پسرانتان بیاموزید؛ زیرا آن دو، هم قرآن و هم دعا است و خشنودى خداى رحمان را در پى دارد."
				 + "\n" + "بر پایه برخى روایات، این دو آیه در معراج پیامبر در آسمان هفتم به وى عطا شد."
				 + "\n" + "در روایتى که علی بن‌ابراهیم به سند خود از امام صادق علیه السلام نقل کرده، آمده است که آیه «آمن‌الرّسول» خطاب دو جانبه و بى‌واسطه خداوند با پیامبر در شب معراج است."
				 + "\n" + "در این روایت، امام صادق علیه السلام از پیامبر صلى الله علیه و آله نقل مى‌کند: هنگامى که در معراج به سدرةالمنتهی رسیدم و تا اندازه دو قوس کمان به او نزدیک شدم، پروردگارم ندا داد: «ءَامنَ الرّسولُ بِما أُنزلَ إِلیهِ مِن رَبّهِ» و من از طرف خود و امّتم به خداوند پاسخ دادم: «و المُؤمِنونَ كُلٌّ ءَامنَ بِاللّهِ و مَلل- كَتهِ و كُتبهِ و رُسلهِ لانُفرّقُ بيَنَ أَحدٍ مِن رُسلِهِ» و گفتم: «سَمِعنا و أَطَعنا غُفرانَكَ رَبَّنا و إِلیكَ المَصِیر»؛ آن‌گاه خداوند فرمود: «لَايُكِلّفُ اللّهُ نَفسًا إِلّا وُسعَها لَها ماكَسبَت و عَلیهَا ما اکتَسبَت» و من از خدا خواستم: «رَبَّنا لَاتُؤاخِذنَا إَن نَسِینا أو أَخطَأنا» و خداوند فرمود: پذیرفتم."
				 + "\n" + "گفتم: «رَبَّنا ولَاتَحمِل عَلَینا إِصرًا كَماحَملتَهُ عَلى الّذِینَ مِن قَبلِنا» و خداوند این دعا را نیز پذیرفت."
				 + "\n" + "و گفتم «رَبَّنا و لَاتُحمّلنا مالَاطاقَةَ لَنَا بِهِ و اعفُ عَنّا واغفِرلَنا وارحَمنَا أَنتَ مَولنا فَانصُرنا عَلى‌القَومِ الکفِرین» و خداوند پاسخ داد: هر آن‌چه را از من خواستى، به تو و امّت تو بخشیدم."
				 + "\n" + "در روایتى دیگر، پیامبر صلى الله علیه و آله با استناد به همین آیه فرموده است: چهار چیز (خطا، فراموشى، آن چه از روى اکراه انجام مى‌شود و آن چه خارج از طاقت انسان است) از امّت من برداشته شده است."
				 + "\n" + "برپایه روایتى منقول از امام علی بن‌ الحسین علیهما السلام پیامبر به قرائت سه آیه آخر سوره بقره سفارش کرده است."
				 + "\n" ;
				
				TextView tv = (TextView ) findViewById(id.txtAyeh);
				tv.setTextSize(18);
				tv.setTextColor(Color.BLACK);
				tv.setText(ta);
		
	}

	
}
